docs/posts/2016-06-01-reconciliation-and-hope.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Jan 07, 2025 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Reconciliation and Hope</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/rss.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Reconciliation and Hope</h1>
<p class="subtitle" role="doc-subtitle">Jun 01, 2016</p>
</header><p>
I wrote this eight years ago, after President Obama&rsquo;s election:
</p>

<blockquote>
<p>
The year that I was born, 1963, was marked by these significant events:
</p>

<ul class="org-ul">
<li>In April, Martin Luther King was arrested and jailed in Birmingham.</li>
<li>In May, “Bull” Connor, the Commissioner of Public Safety in Birmingham used police dogs and fire hoses on a demonstration in Birmingham.</li>
<li>In June, Medgar Evers, the NAACP Field Secretary for Mississippi, was murdered outside his home.</li>
<li>In August, Martin Luther King delivered his famous “I Have a Dream” speech at the Lincoln Memorial in Washington, D.C.</li>
<li>In September, four young girls were killed in the bombing of the Sixteenth Street Baptist Church in Birmingham.</li>
</ul>

<p>
Tuesday, an African-American man was elected President of the United States.
</p>

<p>
The country has certainly come far. European countries are generally viewed as far more progressive than the United States, but, as far as I can tell, no European country is even remotely close to being able to select a member of a minority racial group as head of government.
</p>

<p>
That said, we still have a long ways to go before we can claim to have achieved racial reconciliation. On November 5, David Garland, President of Baylor University, issued a statement concerning recent incidents of racial conflict on Baylor’s campus. We cannot hope to achieve reconciliation in this country if we are not even able to achieve it in the Church. It is time for the Church to not only ask forgiveness for our past sins regarding slavery, but to recognize that failing to take action to create a better future is itself a sin.
</p>

<p>
If nothing else, this week’s election is a sign of hope.
</p>
</blockquote>

<p>
The events of the past eight years proved that progress requires more than simply hope.
</p>


<div class="tagline" id="org57e8329">
<p>
Tagged: <a href="../tags/ethics.html">Ethics</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Jan 07, 2025.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
